app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
---
  def load_post
   @post = Post.find(params[:post_id])

SELECT * FROM "comments" WHERE ("comments"."post_id" = 1) LIMIT 1
---
  def index
    @comments = Comment.find(:all, :conditions => ["post_id = ?", @post.id])

INSERT INTO "comments" ("created_at", "title", "updated_at", "post_id", "user_id", "message") VALUES('2010-08-08 22:32:46', 'dfsdfaf', '2010-08-08 22:32:46', 1, NULL, 'sdfadfsda')
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.post_id = @post.id
    respond_to do |format|
      if @comment.save