app/controllers/forum_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "posts"
---
  def index
    @posts = Post.paginate :all, :page => params[:page], :order => 'created_at DESC', :per_page => 8