app/controllers/messages_controller.rb

  def new
    @message = Message.new

    if params[:reply_to]
      @reply_to = @user.received_messages.find(params[:reply_to])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1 AND ("messages".recipient_id = 3 AND (messages.recipient_deleted = 'f'))) ORDER BY messages.created_at DESC

  def create
    @message = Message.new(params[:message])
    @message.sender = @user
    @message.recipient = User.find_by_username(params[:message][:to])

    if @message.save
---
SELECT * FROM "users" WHERE ("users"."username" = 'admin') LIMIT 1
INSERT INTO "messages" ("created_at", "body", "updated_at", "recipient_id", "subject", "read_at", "sender_id", "sender_deleted", "recipient_deleted") VALUES('2010-08-11 00:25:12', 'hey', '2010-08-11 00:25:12', 3, 'hey', NULL, 4, 'f', 'f')