app/controllers/tags_controller.rb

  def index
    @tags = Tag.find(:all)
    @a = Array.new
    @tags.each do |tag|
      @posts = Post.find_tagged_with(tag)
      @a << @posts.count
---
SELECT * FROM "tags"
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
SELECT count(*) AS count_all FROM "posts"
SELECT count(*) AS count_all FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post')

  def show
     @tag = Tag.find(params[:id])
      @posts = Post.find_tagged_with(@tag)
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.taggable_id = 17) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0