app/controllers/users_controller.rb

SELECT * FROM "posts" WHERE ("posts"."user_id" = 6) LIMIT 1
SELECT count(*) AS count_all FROM "posts" WHERE (user_id = 7)
---
  def profile
    @user = current_user
    @count = Post.count(:conditions => "user_id = #{@user.id}")

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "failed_login_count", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_at", "email") VALUES('2010-08-07 06:31:34', '4defe20b9af01c49d00f8d16cda0ab8614b829ca9fbbfacb6840711816144ba0d6dd8eb8c788fc60c171648ff78a621956644665877485d8cb9f3a609a37d409', '2010-08-07 06:31:34', 'alexw', NULL, 'YmrLvtrNHT1UG70LYN1', NULL, '944fb37d213dc53b7fec36dbd3c4f2ea8e8a8ea8acd8875fa40454390494bba1d0b00ff82080bc8682c0295ee8d9579ebc7143e5f775ea72fc879c84cee43d29', NULL, NULL, 'alexw@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "login_count" = 4, "persistence_token" = 'c20865990ab7a49e79f2dd0a09dfd01ab04d9b5876433eb709843e994be281e1a6ab64d35ef3b25745642a6d46f50cdfaea0fdcfcb4e5f7d961ccdaa930228ce', "updated_at" = '2010-08-07 06:56:45', "last_login_at" = '2010-08-07 06:56:14', "current_login_at" = '2010-08-07 06:56:45', "password_salt" = 'AIa91in4pZQoGK0yVm38', "crypted_password" = '8ab8bb74b8f6ed50357beb85caec24b5d898aeba15a6394c98f012e0fd67c6fabaea806764cb233301e537fa9f31c1ec83177eba566fe0615287c12ac7d39bb0' WHERE "id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])